src/cf/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Бренд</name>
    <type>
      <types>CatalogRef.Бренды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗнаменатель</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьНаПечатьДатуУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДекларацияСоответствия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Единица</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Изображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзображениеИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Импортер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <type>
      <types>CatalogRef.НаборыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьНаПечатьОписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>Сорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураХраненияДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураХраненияОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТехническийРегламент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПополнения</name>
    <type>
      <types>EnumRef.СпособыПополненияЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Качество</name>
    <type>
      <types>CatalogRef.КачествоТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСтарый</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкиСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПроизводителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭД</name>
    <type>
      <types>CatalogRef.КодыТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПоставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьвЛКП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КартинкаРасширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧСтикеры</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокХранения</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвойстваНоменклатуры</name>
    <attributes>
      <name>СвойствоНоменклатуры</name>
      <type>
        <types>CatalogRef.ВидыСвойствНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСвойства</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Хранение</name>
    <attributes>
      <name>Зона</name>
      <type>
        <types>CatalogRef.ЯчейкиСклада</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехнологическаяКарта</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.НормаРасхода</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕИ</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставКомплекта</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Станки</name>
    <attributes>
      <name>Станок</name>
      <type>
        <types>CatalogRef.ПроизводственноеОборудование</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/InformationRegisters/НастройкиПользователей/НастройкиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПользователей</name>
  <resources>
    <name>Значение</name>
    <comment>(Общ)</comment>
    <type>
      <types>Characteristic.ВидыНастроекПользователей</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <comment>(Общ)</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыНастроекПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <dimensions>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Продукция</name>
  </enumValues>
  <enumValues>
    <name>Полуфабрикат</name>
  </enumValues>
  <enumValues>
    <name>Сырье</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Enums/СпособыПополненияЗапасов/СпособыПополненияЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыПополненияЗапасов</name>
  <enumValues>
    <name>Закупка</name>
  </enumValues>
  <enumValues>
    <name>Производство</name>
  </enumValues>
  <enumValues>
    <name>Оба</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Catalogs/Номенклатура/ManagerModule.bsl
#Область Формы_списка_и_выбора

Процедура ЗаполнитьДеревоСегментовДляФормы(ДЗСегменты) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТоварныеГруппы.Ссылка КАК Значение
	                      |ИЗ
	                      |	Справочник.ТоварныеГруппы КАК ТоварныеГруппы
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ТоварныеГруппы.Наименование
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТипыНоменклатуры.Ссылка КАК Значение
	                      |ИЗ
	                      |	Перечисление.ТипыНоменклатуры КАК ТипыНоменклатуры
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ТипыНоменклатуры.Порядок");	
	ДЗСегменты.ПолучитьЭлементы().Очистить();
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	НС = ДЗСегменты.ПолучитьЭлементы().Добавить();
	НС.Значение = "Товарные группы";
	НС.Уровень = 1;	
	Выб = РезультатыЗапроса[0].Выбрать();
	Пока Выб.Следующий() Цикл
		НС2 = НС.ПолучитьЭлементы().Добавить();
		НС2.Значение = Выб.Значение;
		НС2.Уровень = 2;	
	КонецЦикла;
	НС = ДЗСегменты.ПолучитьЭлементы().Добавить();
	НС.Значение = "Типы номенклатуры";
	Выб = РезультатыЗапроса[1].Выбрать();	
	Пока Выб.Следующий() Цикл
		НС2 = НС.ПолучитьЭлементы().Добавить();
		НС2.Значение = Выб.Значение;
		НС2.Уровень = 2;	
	КонецЦикла;	
КонецПроцедуры	

Процедура УстановитьПараметрыСписка(ЭлементФормы, РеквизитФормы, ДЗСегменты) Экспорт
	МасТоварныеГруппы = Новый Массив;
	МасТипыНоменклатуры = Новый Массив;
	// Получаем параметы из отмеченных сегментов
	Узлы = ДЗСегменты.ПолучитьЭлементы();
	Для Каждого УзелГруппа Из Узлы Цикл
		УзлыФильтр = УзелГруппа.ПолучитьЭлементы();
		Для Каждого Узел Из УзлыФильтр Цикл
			Если Не Узел.Пометка Тогда Продолжить КонецЕсли;	
			Если ТипЗнч(Узел.Значение) = Тип("СправочникСсылка.ТоварныеГруппы") Тогда
				МасТоварныеГруппы.Добавить(Узел.Значение);	
			ИначеЕсли ТипЗнч(Узел.Значение) = Тип("ПеречислениеСсылка.ТипыНоменклатуры") Тогда	
				МасТипыНоменклатуры.Добавить(Узел.Значение);	
			КонецЕсли;			
		КонецЦикла;	
	КонецЦикла;
	// Устанавливаем		
	РеквизитФормы.Параметры.УстановитьЗначениеПараметра("ТоварныеГруппыУстановлены", МасТоварныеГруппы.Количество() > 0);
	РеквизитФормы.Параметры.УстановитьЗначениеПараметра("ТоварныеГруппы", МасТоварныеГруппы);
	РеквизитФормы.Параметры.УстановитьЗначениеПараметра("ТипыНоменклатурыУстановлены", МасТипыНоменклатуры.Количество() > 0);
	РеквизитФормы.Параметры.УстановитьЗначениеПараметра("ТипыНоменклатуры", МасТипыНоменклатуры);
	РеквизитФормы.Параметры.УстановитьЗначениеПараметра("МестоХранения", РегистрыСведений.НастройкиПользователей.СкладПользователя());
	Если МасТоварныеГруппы.Количество() > 0 Или МасТипыНоменклатуры.Количество() > 0 Тогда	
		ЭлементФормы.Отображение = ОтображениеТаблицы.Список;
	Иначе
		ЭлементФормы.Отображение = ОтображениеТаблицы.ИерархическийСписок;
	КонецЕсли;
КонецПроцедуры	

#КонецОбласти

#Область Интерфейс

// Возвращает способ пополнения, соответствующий типу номенклатуры.
// Значение используется для новых элементов, при смене типа и при обновлении базы.
// Пользовательский выбор "Оба" эта функция не устанавливает.
//
// Параметры:
//  ТипНоменклатуры - ПеречислениеСсылка.ТипыНоменклатуры - тип номенклатуры.
//
// Возвращаемое значение:
//  ПеречислениеСсылка.СпособыПополненияЗапасов - способ пополнения по умолчанию.
//
Функция СпособПополненияПоУмолчанию(ТипНоменклатуры) Экспорт

	Если ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Продукция
		Или ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Полуфабрикат Тогда
		Возврат Перечисления.СпособыПополненияЗапасов.Производство;
	КонецЕсли;

	Возврат Перечисления.СпособыПополненияЗапасов.Закупка;

КонецФункции

Функция ПолучитьСИерархией(Номенклатура) Экспорт
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗ.Колонки.Добавить("Родитель", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Номенклатура.Ссылка КАК Номенклатура
	                      |ИЗ
	                      |	Справочник.Номенклатура КАК Номенклатура
	                      |ГДЕ
	                      |	Номенклатура.Ссылка В(&Номенклатура)
	                      |ИТОГИ ПО
	                      |	Номенклатура,
	                      |	Номенклатура ИЕРАРХИЯ");
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Выб = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выб.Следующий() Цикл
		ВыбИерархия = Выб.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыбИерархия.Следующий() Цикл
			НС = ТЗ.Добавить();
			НС.Номенклатура = Выб.Номенклатура;
			НС.Родитель = ВыбИерархия.Номенклатура;	
		КонецЦикла;	
	КонецЦикла;
	Возврат ТЗ;	
КонецФункции

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	Если Не Параметры.Свойство("ПодменаАвтоподбора") Тогда Возврат КонецЕсли;
	СтандартнаяОбработка = Ложь;
	Если Параметры.СтрокаПоиска = "" Тогда Возврат КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 30
	                      |	Номенклатура.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ ВТ
	                      |ИЗ
	                      |	Справочник.Номенклатура КАК Номенклатура
	                      |ГДЕ
	                      |	(Номенклатура.Наименование ПОДОБНО &Наименование
	                      |			ИЛИ Номенклатура.Артикул ПОДОБНО &Наименование
	                      |			ИЛИ Номенклатура.КодПоставщика ПОДОБНО &Наименование
	                      |			ИЛИ Номенклатура.КодПроизводителя ПОДОБНО &Наименование)
	                      |	И ВЫБОР
	                      |			КОГДА &ПометкаУдаления
	                      |				ТОГДА ИСТИНА
	                      |			ИНАЧЕ Номенклатура.ПометкаУдаления = ЛОЖЬ
	                      |		КОНЕЦ
	                      |	И ВЫБОР
	                      |			КОГДА &ЕстьТипыНоменклатуры
	                      |				ТОГДА Номенклатура.ТипНоменклатуры В (&ТипыНоменклатуры)
	                      |			ИНАЧЕ ИСТИНА
	                      |		КОНЕЦ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ.Ссылка КАК Ссылка,
	                      |	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика
	                      |ПОМЕСТИТЬ ВТНоменклатура
	                      |ИЗ
	                      |	ВТ КАК ВТ
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ВТ.Ссылка,
	                      |	ХарактеристикиНоменклатуры.Ссылка
	                      |ИЗ
	                      |	ВТ КАК ВТ
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	                      |		ПО ВТ.Ссылка = ХарактеристикиНоменклатуры.Владелец
	                      |			И (НЕ ХарактеристикиНоменклатуры.ПометкаУдаления)
	                      |			И (ВЫБОР
	                      |				КОГДА &ИсключитьХарактеристикиДляВнутреннегоИспользования
	                      |					ТОГДА НЕ ХарактеристикиНоменклатуры.ДляВнутреннегоИспользования
	                      |				ИНАЧЕ ИСТИНА
	                      |			КОНЕЦ)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТНоменклатура.Ссылка КАК Ссылка,
	                      |	ВТНоменклатура.Характеристика КАК Характеристика,
	                      |	ВТНоменклатура.Ссылка.Единица КАК Единица,
	                      |	ВЫБОР
	                      |		КОГДА &ВыводитьСерию
	                      |			ТОГДА ЕСТЬNULL(ТоварыВНаличииОстатки.Серия, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка))
	                      |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	                      |	КОНЕЦ КАК Серия,
	                      |	СУММА(ЕСТЬNULL(ТоварыВНаличииОстатки.КоличествоОстаток, 0)) КАК Остаток,
	                      |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена,
	                      |	ВТНоменклатура.Ссылка.КодПоставщика КАК КодПоставщика,
	                      |	ВТНоменклатура.Ссылка.КодПроизводителя КАК КодПроизводителя
	                      |ИЗ
	                      |	ВТНоменклатура КАК ВТНоменклатура
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВНаличии.Остатки(
	                      |				&ДатаДокумента,
	                      |				ВЫБОР
	                      |					КОГДА &МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ПустаяСсылка)
	                      |						ТОГДА ИСТИНА
	                      |					ИНАЧЕ МестоХранения = &МестоХранения
	                      |				КОНЕЦ) КАК ТоварыВНаличииОстатки
	                      |		ПО ВТНоменклатура.Ссылка = ТоварыВНаличииОстатки.Номенклатура
	                      |			И ВТНоменклатура.Характеристика = ТоварыВНаличииОстатки.Характеристика
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
	                      |		ПО ВТНоменклатура.Ссылка = ЦеныНоменклатурыСрезПоследних.Номенклатура
	                      |			И ВТНоменклатура.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
	                      |			И (ВЫБОР
	                      |				КОГДА &ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	                      |					ТОГДА ЛОЖЬ
	                      |				ИНАЧЕ ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены
	                      |			КОНЕЦ)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВТНоменклатура.Ссылка,
	                      |	ВТНоменклатура.Характеристика,
	                      |	ВТНоменклатура.Ссылка.Единица,
	                      |	ВЫБОР
	                      |		КОГДА &ВыводитьСерию
	                      |			ТОГДА ЕСТЬNULL(ТоварыВНаличииОстатки.Серия, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка))
	                      |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	                      |	КОНЕЦ,
	                      |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ВТНоменклатура.Ссылка.Наименование,
	                      |	ВТНоменклатура.Характеристика.Наименование");
	Запрос.УстановитьПараметр("Наименование", "%" + СтрЗаменить(Параметры.СтрокаПоиска, " ", "%") + "%");
	Запрос.УстановитьПараметр("ПометкаУдаления", ?(Параметры.Отбор.Свойство("ПометкаУдаления"), Параметры.Отбор.ПометкаУдаления, Истина));
	Запрос.УстановитьПараметр("ЕстьТипыНоменклатуры", Параметры.Отбор.Свойство("ТипНоменклатуры"));
	Запрос.УстановитьПараметр("ТипыНоменклатуры", ?(Параметры.Отбор.Свойство("ТипНоменклатуры"), Параметры.Отбор.ТипНоменклатуры, Новый Массив));
	Запрос.УстановитьПараметр("МестоХранения", ?(Параметры.Отбор.Свойство("МестоХранения"), Параметры.Отбор.МестоХранения, РегистрыСведений.НастройкиПользователей.СкладПользователя()));
	Запрос.УстановитьПараметр("ДатаДокумента", ?(Параметры.Отбор.Свойство("ДатаДокумента"), Параметры.Отбор.ДатаДокумента, ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("ВыводитьСерию", ?(Параметры.Свойство("ВыводитьСерию"), Параметры.ВыводитьСерию, Ложь));
	ПараметрыАвтоподбора = Параметры.Отбор.ПараметрыАвтоподбора;
	Запрос.УстановитьПараметр("ВидЦены", ?(ЗначениеЗаполнено(ПараметрыАвтоподбора.ВидЦены), ПараметрыАвтоподбора.ВидЦены, Справочники.ВидыЦен.ПустаяСсылка()));
	Запрос.УстановитьПараметр("ИсключитьХарактеристикиДляВнутреннегоИспользования", ПараметрыАвтоподбора.ИсключитьХарактеристикиДляВнутреннегоИспользования);
	Выб = Запрос.Выполнить().Выбрать();	
	ДанныеВыбора = Новый СписокЗначений;
	Пока Выб.Следующий() Цикл
		Структура = Новый Структура("Ссылка, Характеристика, Серия, Упаковка, Единица, Остаток, Цена, КодПоставщика, КодПроизводителя");
		ЗаполнитьЗначенияСвойств(Структура, Выб);
		ДанныеВыбора.Добавить(Структура);
	КонецЦикла;    
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Подбор номенклатуры в колонках документов (S7).

// Назначение колонки подбора: продукция заказа на производство (верх рабочего места производства, товары заказа).
//
// Возвращаемое значение:
//  Строка - назначение для ТипыПодбора и ДанныеПодбора.
//
Функция НазначениеПодбораПродукция() Экспорт

	Возврат "Продукция";

КонецФункции

// Назначение колонки подбора: материалы (закупки и переработка рабочего места производства, материалы заказа).
//
// Возвращаемое значение:
//  Строка - назначение для ТипыПодбора и ДанныеПодбора.
//
Функция НазначениеПодбораМатериалы() Экспорт

	Возврат "Материалы";

КонецФункции

// Типы номенклатуры, которые предлагает подбор колонки (S7, решение владельца 2026-09-22): продукция - готовая
// продукция и полуфабрикаты, материалы - сырьё, полуфабрикаты и товары. Услуги и комплекты не предлагаются нигде.
//
// Параметры:
//  Назначение - Строка - см. НазначениеПодбораПродукция, НазначениеПодбораМатериалы.
//
// Возвращаемое значение:
//  ФиксированныйМассив из ПеречислениеСсылка.ТипыНоменклатуры - типы подбора.
//
Функция ТипыПодбора(Назначение) Экспорт

	Типы = Новый Массив;
	Если Назначение = НазначениеПодбораПродукция() Тогда
		Типы.Добавить(Перечисления.ТипыНоменклатуры.Продукция);
		Типы.Добавить(Перечисления.ТипыНоменклатуры.Полуфабрикат);
	ИначеЕсли Назначение = НазначениеПодбораМатериалы() Тогда
		Типы.Добавить(Перечисления.ТипыНоменклатуры.Сырье);
		Типы.Добавить(Перечисления.ТипыНоменклатуры.Полуфабрикат);
		Типы.Добавить(Перечисления.ТипыНоменклатуры.Товар);
	Иначе
		ВызватьИсключение СтрШаблон("Неизвестное назначение подбора номенклатуры: %1", Назначение);
	КонецЕсли;
	Возврат Новый ФиксированныйМассив(Типы);

КонецФункции

// Последние созданные позиции номенклатуры заданных типов: не группы, без пометки удаления, с заполненной датой
// создания (у позиций без даты порядок бессмыслен).
//
// Параметры:
//  Типы       - Массив, ФиксированныйМассив из ПеречислениеСсылка.ТипыНоменклатуры - типы позиций.
//  Количество - Число - сколько позиций вернуть.
//
// Возвращаемое значение:
//  СписокЗначений - от новых к старым; значение - Структура: Номенклатура, Характеристика (пустая); представление -
//                   «наименование - создано дд.ММ.гггг».
//
Функция ПоследниеСозданные(Типы, Количество) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	Номенклатура.Наименование КАК Наименование,
	|	Номенклатура.ДатаСоздания КАК ДатаСоздания
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ЭтоГруппа
	|	И НЕ Номенклатура.ПометкаУдаления
	|	И Номенклатура.ТипНоменклатуры В (&Типы)
	|	И Номенклатура.ДатаСоздания > &ПустаяДата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура.ДатаСоздания УБЫВ,
	|	Номенклатура.Наименование";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1", "ПЕРВЫЕ " + Формат(Макс(1, Количество), "ЧГ=0"));
	Запрос.УстановитьПараметр("Типы", Новый Массив(Типы));
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1, 1, 1));
	Список = Новый СписокЗначений;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Значение = Новый Структура("Номенклатура, Характеристика", Выборка.Номенклатура,
			Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		Создано = СтрШаблон(НСтр("ru = 'создано %1'; fr = 'créé le %1'; en = 'created %1'; es = 'creado el %1'"),
			Формат(Выборка.ДатаСоздания, "ДЛФ=D"));
		Список.Добавить(Значение, СтрШаблон("%1 - %2", Выборка.Наименование, Создано));
	КонецЦикла;
	Возврат Список;

КонецФункции

// Данные подбора номенклатуры для колонки: один серверный вызов на нажатие кнопки выбора.
//
// Параметры:
//  Назначение - Строка - см. НазначениеПодбораПродукция, НазначениеПодбораМатериалы.
//
// Возвращаемое значение:
//  Структура:
//   * Типы   - ФиксированныйМассив из ПеречислениеСсылка.ТипыНоменклатуры - см. ТипыПодбора.
//   * Пункты - СписокЗначений - первые пункты списка выбора: у продукции - последние созданные (см. ПоследниеСозданные),
//              у материалов - пусто (материалы заказа форма добавляет сама).
//   * Мягкий - Булево - отбор мягкий: список предлагает и выбор из всей номенклатуры (материалы).
//
Функция ДанныеПодбора(Назначение) Экспорт

	Типы = ТипыПодбора(Назначение);
	ЭтоПродукция = Назначение = НазначениеПодбораПродукция();
	КоличествоПоследних = 10;
	Пункты = ?(ЭтоПродукция, ПоследниеСозданные(Типы, КоличествоПоследних), Новый СписокЗначений);
	Возврат Новый Структура("Типы, Пункты, Мягкий", Типы, Пункты, Не ЭтоПродукция);

КонецФункции

#КонецОбласти

#Область Прочее

// Проверяет, попадал ли комплект в движения товаров в наличии (есть проведённые документы
// со списанием комплекта). Используется для блокировки изменения состава комплекта.
//
// Параметры:
//  Комплект - СправочникСсылка.Номенклатура - проверяемый комплект.
//
// Возвращаемое значение:
//  Булево - Истина, если комплект уже использован в проведённых документах.
//
Функция КомплектИспользованВДокументах(Комплект) Экспорт
	Если Не ЗначениеЗаполнено(Комплект) Тогда
		Возврат Ложь;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК ЕстьДвижение
	|ИЗ
	|	РегистрНакопления.ТоварыВНаличии КАК ТоварыВНаличии
	|ГДЕ
	|	ТоварыВНаличии.Комплект = &Комплект";
	Запрос.УстановитьПараметр("Комплект", Комплект);
	Возврат Не Запрос.Выполнить().Пустой();
КонецФункции

Функция ПолучитьСрокХранения(Товар, Знач Контрагент) Экспорт
	СрокХранения = "";
	Если Товар.ТЧСтикеры.Количество() > 0 Тогда
		Пока 1 = 1 Цикл
			Если Не ЗначениеЗаполнено(Контрагент) Тогда Прервать КонецЕсли;
			Стр = Товар.ТЧСтикеры.Найти(Контрагент, "Контрагент");
			Если Стр = Неопределено Тогда
				Контрагент = Контрагент.Родитель;		
			Иначе	
				СрокХранения = Стр.СрокХранения;
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
	Возврат ?(ЗначениеЗаполнено(СрокХранения), СрокХранения, Товар.СрокХранения);
КонецФункции	

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	// Карточка номенклатуры одна для всех ролей (решение владельца 2026-09-10):
	// подстановки ECommerce-форм по роли больше нет, мобильный клиент - не роль,
	// его ветка сохраняется.
	Если ВидФормы = "ФормаСписка" Тогда
		Если ПараметрыСеанса.ПараметрыКлиентаНаСервере.ЭтоМобильныйКлиент Тогда
			ВыбраннаяФорма = "ФормаВыбораМобильныйКлиент";
		Иначе
			ВыбраннаяФорма = "ФормаДокумента";	
		КонецЕсли;
	КонецЕсли;		
КонецПроцедуры

#КонецОбласти
